# Диаграмма контейнеров
Диаграмма контейнеров C4 показывает высокоуровневую архитектуру системы, выделяя основные подсистемы внутри границ рассматриваемой системы и их взаимодействие.

```mermaid
C4Container
    title Диаграмма контейнеров системы web-приложения TutorFinder

    System_Boundary(boundary, "Система TutorFinder") {
        Container(front, "Front", "HTML + JavaScript", "Реализует взаимодействие <br>с пользователем <br>Оболочка системы")
        ContainerDb(db, "База данных", "PostgreSQL", "Хранит данные приложения")
        Container(back, "Back", "Python", "Обеспечивает функционал <br>системы <br>Работа с БД")
    }

    System_Ext(mail, "Яндекс Почта", "Отправка писем техподдержки")

    Rel(back, db, "Читает/Обновляет данные", "SQL")
    Rel(front, back, "Отправляет запрос на обработку данных", "HTTPS")
    Rel(back, mail, "Отправляет письма", "SMTP")

    UpdateRelStyle(back, db, $offsetY="40")
    UpdateRelStyle(front, back, $offsetX="-165")
    UpdateRelStyle(back, mail, $offsetX="20")
    UpdateLayoutConfig($c4ShapeInRow="2", $c4BoundaryInRow="1")
```

## Описание контейнеров

1. **Front (HTML + JavaScript):**
   - Отображение интерфейса для учеников и репетиторов.
   - Регистрация, вход, заполнение профиля.
   - Поиск репетиторов с фильтрацией по предметам.
   - Отправка заявок и управление ими.

2. **Back (Python / FastAPI):**
   - Обработка запросов от клиентской части.
   - Реализация бизнес-логики приложения.
   - Работа с базой данных через SQLAlchemy.
   - Отправка писем через SMTP.

3. **База данных (PostgreSQL):**
   - Хранит данные о пользователях, профилях, предметах и заявках.

## Внешние системы

1. **Яндекс Почта** — используется для отправки писем при обращении пользователей в техподдержку.
